the/org/the-hydra.org
* Hydra
Hydras are a really fancy feature that let you create families of
related bindings with a common prefix.
** Requirements                                                   :noexport:
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
  ;;; the-hydra.el --- The many-headed keybinding machine

  (require 'the-custom)
  (require 'the-package)
#+end_src

** =use-package= declaration
#+begin_src emacs-lisp
  (use-package hydra
    :demand t)
#+end_src

** Hydras

*** Rectangle Edit Mode
This is basically an improved and more interactive version of the
standard visual mode from Vim.

#+begin_src emacs-lisp
  (defhydra the-hydra-rectangle (:pre (rectangle-mark-mode 1)
                                      :color pink
                                      :hint nil)
    "
   _p_: paste   _r_: replace  _I_: insert
   _y_: copy    _o_: open     _V_: reset
   _d_: kill    _n_: number   _q_: quit
  "
    ("h" backward-char nil)
    ("l" forward-char nil)
    ("k" previous-line nil)
    ("j" next-line nil)
    ("y" copy-rectangle-as-kill)
    ("d" kill-rectangle)
    ("x" clear-rectangle)
    ("o" open-rectangle)
    ("p" yank-rectangle)
    ("r" string-rectangle)
    ("n" rectangle-number-lines)
    ("I" string-insert-rectangle)
    ("V" (if (region-active-p)
             (deactivate-mark)
           (rectangle-mark-mode 1)) nil)
    ("q" keyboard-quit :color blue))

  (bind-keys*
    ("H-T V" . the-hydra-rectangle/body))
#+end_src

** Provides                                                       :noexport:
#+begin_src emacs-lisp
  (provide 'the-hydra)

  ;;; the-hydra.el ends here
#+end_src
